{
	"Changes": [

	// Events arc 2
	// add A hearts to see in eventlookup


	{
	// Event ID 262213017
	"LogName": "Si Adventurer Abigail ME 13",
	"Action": "EditData",
	"Target": "Data/Events/AdventureGuild", // A AdvAbiFirstMine
	"Entries": {
		"262213017/e 262213016/A AdvAbiFirstMine/p Abigail/f Abigail 2000": "continue/7 13/farmer -100 -100 2 Abigail 7 12 0 Marlon 8 11 2/addConversationTopic AdvAbiWeapons 5/skippable/fade/pause 400/emote Marlon 40/pause 200/emote Abigail 8/pause 200/emote Marlon 40/pause 200/playSound doorClose/warp farmer 6 19 0/move farmer 0 -5 0 true/pause 200/emote Abigail 8/pause 200/emote Marlon 40/pause 200/emote farmer 8/pause 200/emote Abigail 16/faceDirection Abigail 2/pause 200/speak Abigail \"@!#$b#Marlon is teaching me about weapons today.\"/pause 200/emote farmer 20/pause 200/speak Marlon \"Choosing the appropriate weapon for your fighting style, as well as caring for it properly, is essential to succeeding as an adventurer.\"/pause 200/speak Abigail \"I already know which one I want!#$b#He showed me a lava katana earlier!$1\"/pause 200/emote Marlon 28/pause 200/speak Marlon \"We'll... work up to that one.#$b#But you're making good progress with the basics.\"/pause 200/speak Abigail \"What weapon do you like to use @?\"/pause 200/quickQuestion What's your fighting style?#This sword I picked up off the ground works well enough.#I let my fists do the talking.#I've got a lava katana! It's loads of fun!#I like the precision I get with my dagger.#This club may look heavy but it gets the job done.#I can get some good hits in with my slingshot.#Oh I've just got this old purple thing I found in the desert.#May I present, THE INFINITY BLADE!(break)speak Abigail \"Wow, did you find that in the mines?\"(break)speak Abigail \"That sounds... painful.$6\"(break)speak Abigail \"Awesome! We should totally train together!$1\"(break)speak Abigail \"And sneak up on enemies like an assassin? That's pretty cool.$1\"(break)speak Abigail \"Wow, how do you lug that thing around all day?$1\"(break)speak Abigail \"That looks kind of hard to aim, but at least you can use rocks for ammo!$1\"(break)speak Abigail \"I love the color! This might be my new favorite.$1\"\\speak Marlon \"Hmm...#$b#Interesting.\"(break)speak Abigail \"WOW! That thing looks powerful!$7\"\\speak Marlon \"Incredible!#$b#That's a legendary weapon, @.#$b#I was not aware you were in possession of one!#$b#I would be honored to look it over sometime.\"/pause 200/emote farmer 20/pause 200/speak Abigail \"I can't wait to get something cooler than this basic sword.\"/pause 200/speak Marlon \"Speaking of that sword, have you been sharpening it regularly like I told you to?\"/pause 300/speak Abigail \"Uhh...$1\"/pause 200/emote Marlon 28/pause 300/end/fade",


		}
	},

	{
	// Event ID 262213018
	"LogName": "Si Adventurer Abigail ME 14",
	"Action": "EditData",
	"Target": "Data/Events/AdventureGuild", // A  AdvAbiWeapons
	"Entries": {
		"262213018/e 262213017/A AdvAbiWeapons/p Abigail/d Mon Tue Wed Thu Fri Sat/f Abigail 2000": "continue/7 13/farmer -100 -100 2 Abigail 5 11 2/addConversationTopic AdvAbiShop 7/skippable/fade/pause 200/emote Abigail 40/pause 200/playSound doorClose/warp farmer 6 19 0/emote Abigail 16/move farmer 0 -5 0 true/pause 100/speak Abigail \"Hi @!\"/pause 400/faceDirection farmer 1/pause 200/faceDirection farmer 3/pause 200/faceDirection farmer 0/pause 200/emote farmer 8/pause 200/speak Abigail \"Marlon's out right now.#$b#He wants me to get some practice managing guild operations, so I'm going to start handling the front desk sometimes.#$b#Gil's still here if something comes up that I don't know how to deal with yet.#$b#If I can prove I've got things under control here, I might even convince him to take a vacation for a change!$1#$b#He really needs one.\"/pause 200/emote farmer 32/pause 200/speak Abigail \"So, what do you need?\"/pause 200/end/fade",
		}
	},

	{
	// Event ID 262213019
	"LogName": "Si Adventurer Abigail ME 14",
	"Action": "EditData",
	"Target": "Data/Events/Mine", // A  AdvAbiShop
	"Entries": {
		"262213019/e 262213018/A AdvAbiShop/p Abigail/f Abigail 2000": "continue/20 8/farmer 18 13 0 Abigail 21 8 0 Marlon 21 6 2/addConversationTopic AdvAbiSpar 7/skippable/fade/pause 300/move farmer 0 -6 1 true/speak Marlon \"Alright, now aim for my left knee.\"/pause 200/specificTemporarySprite swordswipe 21 7/playSound swordswipe/pause 200/speak Marlon \"That was too low.#$b#Make sure you're using the full range of your arm!\"/pause 200/specificTemporarySprite swordswipe 21 7/playSound swordswipe/pause 100/specificTemporarySprite swordswipe 21 7/playSound swordswipe/pause 200/speak Marlon \"Good, now try my other leg. Be sure to mind your footwork.\"/pause 200/positionOffset Abigail 0 8/pause 100/positionOffset Abigail 0 -16/specificTemporarySprite swordswipe 21 7/playSound swordswipe/pause 100/specificTemporarySprite swordswipe 21 7/playSound swordswipe/positionOffset Abigail 0 8/pause 200/animate Abigail false false 900 21 22 21 22 21 22/emote Abigail 28/animate Abigail false false 900 21 22 21 22 21 22 21 22 true/pause 200/emote Marlon 40/pause 100/speak Marlon \"Let's end here for today.\"/pause 200/speak Abigail \"...I think I've got a few rounds left in me.$3\"/pause 200/emote Marlon 40/pause 200/speak Marlon \"@, what do you think?\"/pause 200/quickQuestion Should Abigail continue?#I think she can push a bit longer.#It's important to take breaks.#It's her choice.(break)emote Marlon 56\\pause 200\\speak Marlon \"Very well, try aiming for my left arm this time.\"\\pause 200\\warp Abigail 21 7\\faceDirection Abigail 0\\specificTemporarySprite swordswipe 21 7\\playSound swordswipe\\warp Abigail 21 8\\faceDirection Abigail 0(break)emote Abigail 56\\pause 200\\speak Abigail \"Okay, okay, I'll get some rest and get back to training later. Sound good?\"\\pause 200\\emote Marlon 32(break)emote Abigail 20\\friendship Abigail 100\\pause 200\\speak Abigail \"I'll do a couple more drills and then call it a day, sound good?\"\\pause 200\\emote Marlon 32\\pause 200\\speak Marlon \"Very well, try aiming for my left arm this time.\"\\pause 200\\warp Abigail 21 7\\faceDirection Abigail 0\\specificTemporarySprite swordswipe 21 7\\playSound swordswipe\\warp Abigail 21 8\\faceDirection Abigail 0/pause 200/end/fade",
		}
	},

	{
	// Event ID 262213020
	"LogName": "Si Adventurer Abigail ME 14",
	"Action": "EditData",
	"Target": "Data/Events/Mountain", // A  AdvAbiSpar
	"Entries": {
		"262213020/e 262213019/A AdvAbiSpar/f Abigail 2000": "continue/16 29/farmer 14 29 1 Abigail 17 29 3 Sam 15 28 2 Sebastian 16 28 2/addConversationTopic AdvAbiMtn 3/skippable/fade/pause 200/speak Sam \"And that's when Abigail used the Earthbind scroll on the Roc!$1\"/pause 200/speak Abigail \"I wasn't expecting it to fail that save!$1\"/pause 200/speak Sebastian \"Neither was I...$2\"/pause 200/speak Sam \"You should join our next game night @.#$b#Stuff like this happens all the time!$1\"/pause 200/emote farmer 32/pause 200/speak Abigail \"Speaking of time, I've gotta run.#$b#See you guys later!$1\"/pause 100/faceDirection Abigail 1/speed Abigail 5/move Abigail 10 0 1/warp Abigail -100 -100/pause 100/faceDirection Sam 1/faceDirection Sebastian 1/pause 200/emote Sebastian 40/emote Sam 8/pause 200/faceDirection Sam 2/faceDirection Sebastian 2/pause 200/speak Sebastian \"Abigail's been very busy lately.\"/pause 200/speak Sam \"Doing what? It's not exactly hopping around here.$2\"/pause 200/speak Sebastian \"Whatever it is, she's missed a several game nights, and she usually looks forward to those adventures.$2\"/pause 200/speak Sam \"Band practice too!$7#$b#Do you think something's wrong?$8\"/pause 200/emote Sebastian 40/pause 200/speak Sebastian \"@, do you know what's going on?\"/pause 200/faceDirection farmer 2/pause 200/emote farmer 40/pause 200/emote Sebastian 40/emote Sam 8/pause 200/faceDirection Sam 1/faceDirection Sebastian 3/pause 200/speak Sam \"She knows she can talk to us, right?$2#$b#We're her friends, after all.\"/pause 200/emote Sebastian 40/pause 200/speak Sebastian \"Whatever it is...#$b#I'm sure she will when she's ready.$2\"/pause 200/emote Sam 32/pause 200/emote farmer 28/pause 200/end/fade",
		}
	},

 

	// -s&s1 - enter mountain while abi is there - Trio meets up, then abi checks the time nd runs off, other two commnt on how she alwys seems busy lately 'doing what? It's not exactly hopping around here', was almost late to a gig the other day; 'f do you know what's up?' f '…'

	// -letter from abigail - hey f, we're doing a mine runs, want to come with? We're leaving the guild at X time if you decide to join us!

	// -venture prep - enter guild while she's there within X time range  - m talking w gil, a 'oh hey f glad you made it! Marlon's just checking some things and then we'll go', f 'you've been going on a lot of these lately/are the mines getting easier for you to navigate?/do you still do every trip with marlon?': if 1st, a 'yup, marlon wants me to get lots of practice down there; if 2nd, a 'i still get a bit lost sometimes, but I'm a lot more confident in my sword skills now so i think i csn handle anything that shows up till i find my way back'; if 3rd, a 'yeah, but he's been taking a more hands off approach lately and letting me lead the way so i can practice', a 'most of it's been stuff like gathering ore for the blacksmith, finding passages, and finding cool junk that's lying around. I haven't gotten to do too much fighting with real monsters yet, but he says that'll change as we go deeper in the mines', f :), f ..., f 'have you been seeing much of your friends and family lately?/s&s said you've been pretty busy lately. Do they know about you joining the guild?'; if 1st, a ..., a 'i...haven't told anyone I'm training to be an adventurer yet. Mom and dad would probably freak out, and s&s might make a big deal about it. This is just my thing, you know? I can make my own choices, i don't want anyone else worrying about it.', a ..., a 'pleasw don't tell anyone f', f ..., f 'should I tell them? Yes/No'; if yes, a !, a 'i thought you were my friend f. You helped me get started and now you want to to sabotage everything i worked for?, a frustrated, a 'we'll talk after the mission', rmv some hearts; if No, a <3, a 'thanks f, I knew I could count on you!', m 'have everything? Alright let's go'

	// -venture - enter the mines, get switched to cavern map, open in different area than last time - m and f walking around the mine area, lots of '...' , m 'remember, we're here to collect copper and coal. Try not to get distracted looking for trinkets,' a blush, a walks down, f follows, pan camera down a bit, a walks some more, monster sound, a and f jump, mon shows up near f, a turns, f starts fighting while a watches, a 'okay abi, steady now, you can do this, just go help f', a inches forward, mon appears right behind her, screech, a jumps and turns, f !, f steps forward, another mon in the way, a slashes twice, mon hurting sounds, a slash and screen goes black w slash sound, quiet pause, fade in w mon remnants on ground and a looking at them and marlon now by group, m 'a are you alright?', a 'y-yeah...', f 'great job taking it down!/wow, did you mean to do that?'; if 1, a 'i uh thx i guess'; if 2, a 'i... um...'; m ..., m 'slaying a creature is never something to take lightly. You acted in self defense, young adventurer, and you did it quickly, painlessly, and out of necessity. You did well.', a ..., a 'right...', m ..., m 'let us return to the surface for now. I'm sure clint will understand if his order is slightly delayed.' Add stone, copper, coal, and some trinket (or geodes?) to player

	// -talk - enter abi home while she's there - f enters room, a 'hi f, what's up?', f 'i wanted to check on you after what happened in the mines/do you want to talk about what happened in the mines?', a 'close the door please', doorclose sound and action (can i close doors in events? If not take out), a walk to window, a ..., a 'I'm okay, i just... I guess is like before. I thought I'd be ready, i was all set to take down monsters, and I even followed through! But now i just feel so guilty. Lime I could have pushed it off and run away instead or something... do you ever feel like that?', f 'yes/no/sometimes'; if 1, a 'I'm glad I'm not alone in that'; if 2, a 'i guess it's just me...'; if 3, a 'i guess it's something I'll get used to. At least we're together in this, huh?'; f 'you don't have to deal with this on your own/you shouldn't bottle up what you're going through'; a 'you're saying I should talk to the others about it? What if they can't understand?', f 'they don't have to understand just to be there for you/give them some credit, I'm sure they'll do their best for you', a ..., a 'you're right, I've been trying to go through all this alone to prove to myself that i can do it, but that doesn't mean I can't ask my friends to support me. I'd xo the same for them!', f :), a 'just... let's save telling my parents for another time, alright? I'm not sure how to handle that conversation yet', f music note, a <3 (add/readd hearts back), cam pans down to caroline outside door as fade out
	
	// -s&s2 - meet in -place- - a 'thanks for coming guys, i wanted to talk to you about why I've been so busy lately', seb 'we were starting to get a bit worried about that', sam 'a bit? You used to be down for everything, and now you're out more than I've ever been with joja! Did you get a new job or something?', seb 'you did say you didn't want to work at your dad's shop forever...', a 'well... sorta', s&s ?, a 'f knows what's going on and convinced me that i should talk with my friends about it. So...', sam 'heck yeah, we're your friends!', seb 'you can tell us anything. We are here for you.', a :), a 'so a little while ago, I found out we have an adventurers guild nearby, and i decided to join up!', s&s !, sam 'wait you're an adventurer? Like f? That's so awesome!', a blush, a 'well I'm still in training. That's what's been taking up all my time', seb 'that sounds like a lot of hard work. Do you go to the mines a lot? Who trains you?', a 'so you know that old guy with the cape who shows up at town festivals?', seb 'i think my mom knows him', sam 'the guy with the obvious crush on marnie?', a 'yeah! He's the head of our guild branch, and he's been teaching me loads of stuff', seb 'huh, so that's how he gets all those monsters to display for spirits eve. Do you help him fight them?', a '...' sad, a 'actually, let me tell you about what happened the other day...', s&s ?, a ..., a sweatdrop, s&s !, s ?, s ..., a ..., etc, f heads out if the room quietly, msg 'abigail seems to have this covered. I'll give them space to talk.'







	//{
	// Event ID 262213 TEMPLATE
	//"LogName": "Si Adventurer Abigail ME 00",
	//"Action": "EditData",
	//"Target": "Data/Events/AdventureGuild", // 
	//"Entries": {
		//"2001/f Abigail 2000": "continue/7 13/farmer -100 -100 2 Abigail 7 12 0 Marlon 8 11 2/skippable/fade/pause 400/end/fade",
		//}
	//},




	]
}


























